; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation8 - direction
	GroundStation2 - direction
	Star7 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
)
(:goal (and
	(pointing satellite0 Planet16)
	(have_image Star14 image1)
	(have_image Star15 thermograph0)
	(have_image Planet16 thermograph0)
	(have_image Star17 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 planet16 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet16)
   goals met: 1 of 5
3. (turn_to satellite0 star7 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 planet16 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet16)
   goals met: 1 of 5
6. (take_image satellite0 planet16 instrument0 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 2 of 5
7. (turn_to satellite0 star14 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star14)
   goals met: 1 of 5
8. (take_image satellite0 star14 instrument0 image1)
   added: (have_image star14 image1)
   goals met: 2 of 5
9. (turn_to satellite0 planet16 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet16)
   goals met: 3 of 5
10. (turn_to satellite0 star15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star15)
   goals met: 2 of 5
11. (take_image satellite0 star15 instrument0 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 3 of 5
12. (turn_to satellite0 planet16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet16)
   goals met: 4 of 5
13. (turn_to satellite0 star17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star17)
   goals met: 3 of 5
14. (take_image satellite0 star17 instrument0 image1)
   added: (have_image star17 image1)
   goals met: 4 of 5
15. (turn_to satellite0 planet16 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 planet16)
   goals met: 5 of 5
